% clear;clc
% %2000到2019年的人口自然增长率(‰)
% RaSum=fliplr([3.34	3.81	5.32	5.86	4.96	5.21	4.92	4.95	4.79	4.79	4.87	5.08	5.17	5.28	5.89	5.87	6.01	6.45	6.95	7.58])
% %========================================================================================
% time=2000:2150;
% RaSum2020100=huise1(RaSum,81+50)
% plot(time,[RaSum RaSum2020100])

%====================================================================================
clear;clc
%2012到2019年的出生吕(‰)
RaBIR=fliplr([10.48	10.94	12.43	12.95	12.07	12.37	12.08	12.1]);
RaDIE=fliplr([7.14	7.13	7.11	7.09	7.11	7.16	7.16	7.15]);
RaT=RaBIR-RaDIE;

%========================================================================================
time=2012:2050;
lineZero=zeros(1,39);
YRaBIR=huise1(RaBIR,31);
YRaDIE=huise1(RaDIE,31);
YRaT=YRaBIR-YRaDIE;
plot(time,[RaT YRaT],time,lineZero)
xlabel('年份')
%set(gca,'XTick',2012:2050);
ylabel('自然增长率/%')
%set(gca,'YTick',105:120);
%legend('放开二胎后的实际值','原政策下的预测值')



